GreatCowBASIC/DATFileGenerator/incfiles/p18F54Q71.inc
        LIST
;==========================================================================
;
;  Built by Great Cow BASIC convertor
;  MPASM processor include for the chip shown below
;
; C:\Program Files\Microchip\MPLABX\v6.15\packs\index.idx
; C:\Program Files\Microchip\MPLABX\v6.15\packs\Microchip\PIC18F-Q_DFP\1.20.405\xc8\pic\dat\ini\18F54Q71.ini
; C:\Program Files\Microchip\MPLABX\v6.15\packs\Microchip\PIC18F-Q_DFP\1.20.405\edc\18F54Q71.PIC
; C:\Program Files\Microchip\MPLABX\v6.15\packs\Microchip\PIC18F-Q_DFP\1.20.405\xc8\pic\dat\cfgdata\18F54Q71.cfgdata
;
;==========================================================================
        NOLIST
        IFNDEF __PIC18F54Q71
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF
;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0             EQU  0
FSR1             EQU  1
FSR2             EQU  2
FAST             EQU  1
W                EQU  0
A                EQU  0
ACCESS           EQU  0
BANKED           EQU  1
;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
CLKRCON          EQU  H'0039'
CLKRCLK          EQU  H'003A'
NVMCON0          EQU  H'0040'
NVMCON1          EQU  H'0041'
NVMLOCK          EQU  H'0042'
NVMADR           EQU  H'0043'
NVMADRL          EQU  H'0043'
NVMADRH          EQU  H'0044'
NVMADRU          EQU  H'0045'
NVMDAT           EQU  H'0046'
NVMDATL          EQU  H'0046'
NVMDATH          EQU  H'0047'
VREGCON          EQU  H'0048'
BORCON           EQU  H'0049'
HLVDCON0         EQU  H'004A'
HLVDCON1         EQU  H'004B'
ZCDCON           EQU  H'004C'
PMD0             EQU  H'0062'
PMD1             EQU  H'0063'
PMD2             EQU  H'0064'
PMD3             EQU  H'0065'
PMD4             EQU  H'0066'
PMD5             EQU  H'0067'
PMD6             EQU  H'0068'
CMOUT            EQU  H'006F'
CM1CON0          EQU  H'0070'
CM1CON1          EQU  H'0071'
CM1NCH           EQU  H'0072'
CM1PCH           EQU  H'0073'
CM2CON0          EQU  H'0074'
CM2CON1          EQU  H'0075'
CM2NCH           EQU  H'0076'
CM2PCH           EQU  H'0077'
WDTCON0          EQU  H'0078'
WDTCON1          EQU  H'0079'
WDTPS            EQU  H'007A'
WDTPSL           EQU  H'007A'
WDTPSH           EQU  H'007B'
WDTTMR           EQU  H'007C'
DAC1DAT          EQU  H'007D'
DAC1DATL         EQU  H'007D'
DAC1DATH         EQU  H'007E'
DAC1CON          EQU  H'007F'
SPI1RXB          EQU  H'0080'
SPI1TXB          EQU  H'0081'
SPI1TCNT         EQU  H'0082'
SPI1TCNTL        EQU  H'0082'
SPI1TCNTH        EQU  H'0083'
SPI1CON0         EQU  H'0084'
SPI1CON1         EQU  H'0085'
SPI1CON2         EQU  H'0086'
SPI1STATUS       EQU  H'0087'
SPI1TWIDTH       EQU  H'0088'
SPI1BAUD         EQU  H'0089'
SPI1INTF         EQU  H'008A'
SPI1INTE         EQU  H'008B'
SPI1CLK          EQU  H'008C'
ACTCON           EQU  H'00AC'
OSCCON1          EQU  H'00AD'
OSCCON2          EQU  H'00AE'
OSCCON3          EQU  H'00AF'
OSCTUNE          EQU  H'00B0'
OSCFRQ           EQU  H'00B1'
OSCFREQ          EQU  H'00B1'
OSCSTAT          EQU  H'00B2'
OSCSTAT1         EQU  H'00B2'
OSCEN            EQU  H'00B3'
PRLOCK           EQU  H'00B4'
SCANPR           EQU  H'00B5'
DMA1PR           EQU  H'00B6'
DMA2PR           EQU  H'00B7'
DMA3PR           EQU  H'00B8'
DMA4PR           EQU  H'00B9'
MAINPR           EQU  H'00BE'
ISRPR            EQU  H'00BF'
DAC2DAT          EQU  H'00C0'
DAC2DATL         EQU  H'00C0'
DAC2CON          EQU  H'00C2'
DAC3DAT          EQU  H'00C3'
DAC3DATL         EQU  H'00C3'
DAC3CON          EQU  H'00C5'
CLCDATA          EQU  H'00D4'
CLCSELECT        EQU  H'00D5'
CLCNCON          EQU  H'00D6'
CLCNPOL          EQU  H'00D7'
CLCNSEL0         EQU  H'00D8'
CLCNSEL1         EQU  H'00D9'
CLCNSEL2         EQU  H'00DA'
CLCNSEL3         EQU  H'00DB'
CLCNGLS0         EQU  H'00DC'
CLCNGLS1         EQU  H'00DD'
CLCNGLS2         EQU  H'00DE'
CLCNGLS3         EQU  H'00DF'
DMASELECT        EQU  H'00E8'
DMANBUF          EQU  H'00E9'
DMANDCNT         EQU  H'00EA'
DMANDCNTL        EQU  H'00EA'
DMANDCNTH        EQU  H'00EB'
DMANDPTR         EQU  H'00EC'
DMANDPTRL        EQU  H'00EC'
DMANDPTRH        EQU  H'00ED'
DMANDSZ          EQU  H'00EE'
DMANDSZL         EQU  H'00EE'
DMANDSZH         EQU  H'00EF'
DMANDSA          EQU  H'00F0'
DMANDSAL         EQU  H'00F0'
DMANDSAH         EQU  H'00F1'
DMANSCNT         EQU  H'00F2'
DMANSCNTL        EQU  H'00F2'
DMANSCNTH        EQU  H'00F3'
DMANSPTR         EQU  H'00F4'
DMANSPTRL        EQU  H'00F4'
DMANSPTRH        EQU  H'00F5'
DMANSPTRU        EQU  H'00F6'
DMANSSZ          EQU  H'00F7'
DMANSSZL         EQU  H'00F7'
DMANSSZH         EQU  H'00F8'
DMANSSA          EQU  H'00F9'
DMANSSAL         EQU  H'00F9'
DMANSSAH         EQU  H'00FA'
DMANSSAU         EQU  H'00FB'
DMANCON0         EQU  H'00FC'
DMANCON1         EQU  H'00FD'
DMANAIRQ         EQU  H'00FE'
DMANSIRQ         EQU  H'00FF'
PORTW            EQU  H'0100'
LATW             EQU  H'0101'
PORTWIN0         EQU  H'0102'
PORTWIN1         EQU  H'0103'
PORTWIN2         EQU  H'0104'
PORTWIN3         EQU  H'0105'
PORTWIN4         EQU  H'0106'
PORTWIN5         EQU  H'0107'
PORTWIN6         EQU  H'0108'
PORTWIN7         EQU  H'0109'
PORTWCLK         EQU  H'010A'
PORTWDF          EQU  H'010B'
PORTWCON         EQU  H'010C'
ADCGA            EQU  H'0110'
ADCGB            EQU  H'0111'
ADCGC            EQU  H'0112'
ADCGD            EQU  H'0113'
ADCGE            EQU  H'0114'
ADCGF            EQU  H'0115'
OPA1CON0         EQU  H'011F'
OPA1CON1         EQU  H'0120'
OPA1CON2         EQU  H'0121'
OPA1CON3         EQU  H'0122'
OPA1CON4         EQU  H'0123'
OPA1HWC          EQU  H'0124'
OPA1OFFSET       EQU  H'0125'
OPA1ORS          EQU  H'0126'
OPA2CON0         EQU  H'0127'
OPA2CON1         EQU  H'0128'
OPA2CON2         EQU  H'0129'
OPA2CON3         EQU  H'012A'
OPA2CON4         EQU  H'012B'
OPA2HWC          EQU  H'012C'
OPA2OFFSET       EQU  H'012D'
OPA2ORS          EQU  H'012E'
LATA             EQU  H'0140'
LATB             EQU  H'0141'
LATC             EQU  H'0142'
LATD             EQU  H'0143'
LATE             EQU  H'0144'
LATF             EQU  H'0145'
TRISA            EQU  H'0148'
TRISB            EQU  H'0149'
TRISC            EQU  H'014A'
TRISD            EQU  H'014B'
TRISE            EQU  H'014C'
TRISF            EQU  H'014D'
PORTA            EQU  H'0150'
PORTB            EQU  H'0151'
PORTC            EQU  H'0152'
PORTD            EQU  H'0153'
PORTE            EQU  H'0154'
PORTF            EQU  H'0155'
APMCON           EQU  H'01C0'
APMPRE           EQU  H'01C1'
APMPREL          EQU  H'01C1'
APMPREH          EQU  H'01C2'
APMPER           EQU  H'01C3'
APMPERL          EQU  H'01C3'
APMPERH          EQU  H'01C4'
APMSTART1        EQU  H'01C5'
APMSTART1L       EQU  H'01C5'
APMSTART1H       EQU  H'01C6'
APMPERS1         EQU  H'01C7'
APMPERS1L        EQU  H'01C7'
APMPERS1H        EQU  H'01C8'
APMSTART2        EQU  H'01C9'
APMSTART2L       EQU  H'01C9'
APMSTART2H       EQU  H'01CA'
APMSTART2U       EQU  H'01CB'
APMPERS2         EQU  H'01CC'
APMPERS2L        EQU  H'01CC'
APMPERS2H        EQU  H'01CD'
APMEND1          EQU  H'01CE'
APMEND1L         EQU  H'01CE'
APMEND1H         EQU  H'01CF'
APMEND1U         EQU  H'01D0'
APMPERE1         EQU  H'01D1'
APMPERE1L        EQU  H'01D1'
APMPERE1H        EQU  H'01D2'
APMEND2          EQU  H'01D3'
APMEND2L         EQU  H'01D3'
APMEND2H         EQU  H'01D4'
APMEND2U         EQU  H'01D5'
APMPERE2         EQU  H'01D6'
APMPERE2L        EQU  H'01D6'
APMPERE2H        EQU  H'01D7'
APMCLK           EQU  H'01D8'
APMSTATUS        EQU  H'01D9'
APMSTATUSL       EQU  H'01D9'
APMSTATUSH       EQU  H'01DA'
PPSLOCK          EQU  H'0200'
RA0PPS           EQU  H'0201'
RA1PPS           EQU  H'0202'
RA2PPS           EQU  H'0203'
RA3PPS           EQU  H'0204'
RA4PPS           EQU  H'0205'
RA5PPS           EQU  H'0206'
RA6PPS           EQU  H'0207'
RA7PPS           EQU  H'0208'
RB0PPS           EQU  H'0209'
RB1PPS           EQU  H'020A'
RB2PPS           EQU  H'020B'
RB3PPS           EQU  H'020C'
RB4PPS           EQU  H'020D'
RB5PPS           EQU  H'020E'
RB6PPS           EQU  H'020F'
RB7PPS           EQU  H'0210'
RC0PPS           EQU  H'0211'
RC1PPS           EQU  H'0212'
RC2PPS           EQU  H'0213'
RC3PPS           EQU  H'0214'
RC4PPS           EQU  H'0215'
RC5PPS           EQU  H'0216'
RC6PPS           EQU  H'0217'
RC7PPS           EQU  H'0218'
RD0PPS           EQU  H'0219'
RD1PPS           EQU  H'021A'
RD2PPS           EQU  H'021B'
RD3PPS           EQU  H'021C'
RD4PPS           EQU  H'021D'
RD5PPS           EQU  H'021E'
RD6PPS           EQU  H'021F'
RD7PPS           EQU  H'0220'
RE0PPS           EQU  H'0221'
RE1PPS           EQU  H'0222'
RE2PPS           EQU  H'0223'
RF0PPS           EQU  H'0225'
RF1PPS           EQU  H'0226'
RF2PPS           EQU  H'0227'
RF3PPS           EQU  H'0228'
RF4PPS           EQU  H'0229'
RF5PPS           EQU  H'022A'
RF6PPS           EQU  H'022B'
RF7PPS           EQU  H'022C'
INT0PPS          EQU  H'023E'
INT1PPS          EQU  H'023F'
INT2PPS          EQU  H'0240'
T0CKIPPS         EQU  H'0241'
T1CKIPPS         EQU  H'0242'
T1GPPS           EQU  H'0243'
T3CKIPPS         EQU  H'0244'
T3GPPS           EQU  H'0245'
T2INPPS          EQU  H'0248'
T4INPPS          EQU  H'0249'
CCP1PPS          EQU  H'024F'
CCP2PPS          EQU  H'0250'
PWM1ERSPPS       EQU  H'0251'
PWM2ERSPPS       EQU  H'0252'
PWM3ERSPPS       EQU  H'0253'
PWMIN0PPS        EQU  H'0257'
PWMIN1PPS        EQU  H'0258'
CWG1PPS          EQU  H'025B'
CWG1INPPS        EQU  H'025B'
CLCIN0PPS        EQU  H'0261'
CLCIN1PPS        EQU  H'0262'
CLCIN2PPS        EQU  H'0263'
CLCIN3PPS        EQU  H'0264'
CLCIN4PPS        EQU  H'0265'
CLCIN5PPS        EQU  H'0266'
CLCIN6PPS        EQU  H'0267'
CLCIN7PPS        EQU  H'0268'
ADACTPPS         EQU  H'0269'
SPI1SCKPPS       EQU  H'026A'
SPI1SDIPPS       EQU  H'026B'
SPI1SSPPS        EQU  H'026C'
I2C1SDAPPS       EQU  H'0270'
I2C1SCLPPS       EQU  H'0271'
U1RXPPS          EQU  H'0272'
U1CTSPPS         EQU  H'0273'
U2RXPPS          EQU  H'0274'
U2CTSPPS         EQU  H'0275'
OPA1ORPPS        EQU  H'0276'
OPA2ORPPS        EQU  H'0277'
TUIN0PPS         EQU  H'0278'
TUIN1PPS         EQU  H'0279'
APMCLKPPS        EQU  H'027A'
RB2I2C           EQU  H'0285'
RB1I2C           EQU  H'0286'
RC4I2C           EQU  H'0287'
RC3I2C           EQU  H'0288'
I2C1RXB          EQU  H'0289'
I2C1TXB          EQU  H'028A'
I2C1CNT          EQU  H'028B'
I2C1CNTL         EQU  H'028B'
I2C1CNTH         EQU  H'028C'
I2C1ADB0         EQU  H'028D'
I2C1ADB1         EQU  H'028E'
I2C1ADR0         EQU  H'028F'
I2C1ADR1         EQU  H'0290'
I2C1ADR2         EQU  H'0291'
I2C1ADR3         EQU  H'0292'
I2C1CON0         EQU  H'0293'
I2C1CON1         EQU  H'0294'
I2C1CON2         EQU  H'0295'
I2C1CON3         EQU  H'0296'
I2C1ERR          EQU  H'0297'
I2C1STAT0        EQU  H'0298'
I2C1STAT1        EQU  H'0299'
I2C1PIR          EQU  H'029A'
I2C1PIE          EQU  H'029B'
I2C1BTO          EQU  H'029C'
I2C1BAUD         EQU  H'029D'
I2C1CLK          EQU  H'029E'
I2C1BTOC         EQU  H'029F'
U1RXB            EQU  H'02A0'
U1RXBL           EQU  H'02A0'
U1RXCHK          EQU  H'02A1'
U1TXB            EQU  H'02A2'
U1TXBL           EQU  H'02A2'
U1TXCHK          EQU  H'02A3'
U1P1             EQU  H'02A4'
U1P1L            EQU  H'02A4'
U1P1H            EQU  H'02A5'
U1P2             EQU  H'02A6'
U1P2L            EQU  H'02A6'
U1P2H            EQU  H'02A7'
U1P3             EQU  H'02A8'
U1P3L            EQU  H'02A8'
U1P3H            EQU  H'02A9'
U1CON0           EQU  H'02AA'
U1CON1           EQU  H'02AB'
U1CON2           EQU  H'02AC'
U1BRG            EQU  H'02AD'
U1BRGL           EQU  H'02AD'
U1BRGH           EQU  H'02AE'
U1FIFO           EQU  H'02AF'
U1UIR            EQU  H'02B0'
U1ERRIR          EQU  H'02B1'
U1ERRIE          EQU  H'02B2'
U2RXB            EQU  H'02B4'
U2RXBL           EQU  H'02B4'
U2TXB            EQU  H'02B6'
U2TXBL           EQU  H'02B6'
U2P1             EQU  H'02B8'
U2P1L            EQU  H'02B8'
U2P2             EQU  H'02BA'
U2P2L            EQU  H'02BA'
U2P3             EQU  H'02BC'
U2P3L            EQU  H'02BC'
U2CON0           EQU  H'02BE'
U2CON1           EQU  H'02BF'
U2CON2           EQU  H'02C0'
U2BRG            EQU  H'02C1'
U2BRGL           EQU  H'02C1'
U2BRGH           EQU  H'02C2'
U2FIFO           EQU  H'02C3'
U2UIR            EQU  H'02C4'
U2ERRIR          EQU  H'02C5'
U2ERRIE          EQU  H'02C6'
TMR1             EQU  H'0312'
TMR1L            EQU  H'0312'
TMR1H            EQU  H'0313'
T1CON            EQU  H'0314'
TMR1CON          EQU  H'0314'
T1GCON           EQU  H'0315'
TMR1GCON         EQU  H'0315'
T1GATE           EQU  H'0316'
TMR1GATE         EQU  H'0316'
T1CLK            EQU  H'0317'
TMR1CLK          EQU  H'0317'
PR1              EQU  H'0317'
TMR0L            EQU  H'0318'
TMR0             EQU  H'0318'
TMR0H            EQU  H'0319'
PR0              EQU  H'0319'
T0CON0           EQU  H'031A'
T0CON1           EQU  H'031B'
T2TMR            EQU  H'031D'
TMR2             EQU  H'031D'
T2PR             EQU  H'031E'
PR2              EQU  H'031E'
T2CON            EQU  H'031F'
T2HLT            EQU  H'0320'
T2CLKCON         EQU  H'0321'
T2CLK            EQU  H'0321'
T2RST            EQU  H'0322'
TMR3             EQU  H'0323'
TMR3L            EQU  H'0323'
TMR3H            EQU  H'0324'
T3CON            EQU  H'0325'
TMR3CON          EQU  H'0325'
T3GCON           EQU  H'0326'
TMR3GCON         EQU  H'0326'
T3GATE           EQU  H'0327'
TMR3GATE         EQU  H'0327'
T3CLK            EQU  H'0328'
TMR3CLK          EQU  H'0328'
PR3              EQU  H'0328'
T4TMR            EQU  H'032A'
TMR4             EQU  H'032A'
T4PR             EQU  H'032B'
PR4              EQU  H'032B'
T4CON            EQU  H'032C'
T4HLT            EQU  H'032D'
T4CLKCON         EQU  H'032E'
T4CLK            EQU  H'032E'
T4RST            EQU  H'032F'
CCPR1            EQU  H'0340'
CCPR1L           EQU  H'0340'
CCPR1H           EQU  H'0341'
CCP1CON          EQU  H'0342'
CCP1CAP          EQU  H'0343'
CCPR2            EQU  H'0344'
CCPR2L           EQU  H'0344'
CCPR2H           EQU  H'0345'
CCP2CON          EQU  H'0346'
CCP2CAP          EQU  H'0347'
CCPTMRS0         EQU  H'034C'
CRCDATA          EQU  H'034E'
CRCDATAL         EQU  H'034E'
CRCDATAH         EQU  H'034F'
CRCDATAU         EQU  H'0350'
CRCDATAT         EQU  H'0351'
CRCOUT           EQU  H'0352'
CRCSHFT          EQU  H'0352'
CRCXOR           EQU  H'0352'
CRCOUTL          EQU  H'0352'
CRCSHFTL         EQU  H'0352'
CRCSHIFTL        EQU  H'0352'
CRCXORL          EQU  H'0352'
CRCOUTH          EQU  H'0353'
CRCSHFTH         EQU  H'0353'
CRCSHIFTH        EQU  H'0353'
CRCXORH          EQU  H'0353'
CRCOUTU          EQU  H'0354'
CRCSHFTU         EQU  H'0354'
CRCSHIFTU        EQU  H'0354'
CRCXORU          EQU  H'0354'
CRCOUTT          EQU  H'0355'
CRCSHFTT         EQU  H'0355'
CRCSHIFTT        EQU  H'0355'
CRCXORT          EQU  H'0355'
CRCCON0          EQU  H'0356'
CRCCON1          EQU  H'0357'
CRCCON2          EQU  H'0358'
SCANLADR         EQU  H'035A'
SCANLADRL        EQU  H'035A'
SCANLADRH        EQU  H'035B'
SCANLADRU        EQU  H'035C'
SCANHADR         EQU  H'035D'
SCANHADRL        EQU  H'035D'
SCANHADRH        EQU  H'035E'
SCANHADRU        EQU  H'035F'
SCANCON0         EQU  H'0360'
SCANTRIG         EQU  H'0361'
STATUS_CSHAD     EQU  H'0373'
WREG_CSHAD       EQU  H'0374'
BSR_CSHAD        EQU  H'0375'
SHADCON          EQU  H'0376'
STATUS_SHAD      EQU  H'0377'
WREG_SHAD        EQU  H'0378'
BSR_SHAD         EQU  H'0379'
PCLATH_SHAD      EQU  H'037A'
PCLATU_SHAD      EQU  H'037B'
FSR0SH           EQU  H'037C'
FSR0L_SHAD       EQU  H'037C'
FSR0H_SHAD       EQU  H'037D'
FSR1SH           EQU  H'037E'
FSR1L_SHAD       EQU  H'037E'
FSR1H_SHAD       EQU  H'037F'
FSR2SH           EQU  H'0380'
FSR2L_SHAD       EQU  H'0380'
FSR2H_SHAD       EQU  H'0381'
PRODSH           EQU  H'0382'
PRODL_SHAD       EQU  H'0382'
PRODH_SHAD       EQU  H'0383'
TU16ACON0        EQU  H'03A0'
TU16ACON1        EQU  H'03A1'
TU16AHLT         EQU  H'03A2'
TU16APS          EQU  H'03A3'
TU16ATMR         EQU  H'03A4'
TU16ACR          EQU  H'03A4'
TU16ATMRL        EQU  H'03A4'
TU16ACRL         EQU  H'03A4'
TU16ATMRH        EQU  H'03A5'
TU16ACRH         EQU  H'03A5'
TU16APR          EQU  H'03A6'
TU16APRL         EQU  H'03A6'
TU16APRH         EQU  H'03A7'
TU16ACLK         EQU  H'03A8'
TU16AERS         EQU  H'03A9'
TU16BCON0        EQU  H'03AA'
TU16BCON1        EQU  H'03AB'
TU16BHLT         EQU  H'03AC'
TU16BPS          EQU  H'03AD'
TU16BTMR         EQU  H'03AE'
TU16BCR          EQU  H'03AE'
TU16BTMRL        EQU  H'03AE'
TU16BCRL         EQU  H'03AE'
TU16BTMRH        EQU  H'03AF'
TU16BCRH         EQU  H'03AF'
TU16BPR          EQU  H'03B0'
TU16BPRL         EQU  H'03B0'
TU16BPRH         EQU  H'03B1'
TU16BCLK         EQU  H'03B2'
TU16BERS         EQU  H'03B3'
TUCHAIN          EQU  H'03B4'
CWG1CLK          EQU  H'03BC'
CWG1CLKCON       EQU  H'03BC'
CWG1ISM          EQU  H'03BD'
CWG1DAT          EQU  H'03BD'
CWG1DBR          EQU  H'03BE'
CWG1DBF          EQU  H'03BF'
CWG1CON0         EQU  H'03C0'
CWG1CON1         EQU  H'03C1'
CWG1AS0          EQU  H'03C2'
CWG1AS1          EQU  H'03C3'
CWG1STR          EQU  H'03C4'
FVRCON           EQU  H'03D7'
ADCPCON          EQU  H'03D8'
ADCP             EQU  H'03D8'
ADLTH            EQU  H'03D9'
ADLTHL           EQU  H'03D9'
ADLTHH           EQU  H'03DA'
ADUTH            EQU  H'03DB'
ADUTHL           EQU  H'03DB'
ADUTHH           EQU  H'03DC'
ADERR            EQU  H'03DD'
ADERRL           EQU  H'03DD'
ADERRH           EQU  H'03DE'
ADSTPT           EQU  H'03DF'
ADSTPTL          EQU  H'03DF'
ADSTPTH          EQU  H'03E0'
ADFLTR           EQU  H'03E1'
ADFLTRL          EQU  H'03E1'
ADFLTRH          EQU  H'03E2'
ADACC            EQU  H'03E3'
ADACCL           EQU  H'03E3'
ADACCH           EQU  H'03E4'
ADACCU           EQU  H'03E5'
ADCNT            EQU  H'03E6'
ADRPT            EQU  H'03E7'
ADPREV           EQU  H'03E8'
ADPREVL          EQU  H'03E8'
ADPREVH          EQU  H'03E9'
ADRES            EQU  H'03EA'
ADRESL           EQU  H'03EA'
ADRESH           EQU  H'03EB'
ADPCH            EQU  H'03EC'
ADNCH            EQU  H'03ED'
ADACQ            EQU  H'03EE'
ADACQL           EQU  H'03EE'
ADACQH           EQU  H'03EF'
ADCAP            EQU  H'03F0'
ADPRE            EQU  H'03F1'
ADPREL           EQU  H'03F1'
ADPREH           EQU  H'03F2'
ADCON0           EQU  H'03F3'
ADCON1           EQU  H'03F4'
ADCON2           EQU  H'03F5'
ADCON3           EQU  H'03F6'
ADSTAT           EQU  H'03F7'
ADREF            EQU  H'03F8'
ADACT            EQU  H'03F9'
ADCLK            EQU  H'03FA'
ADCTX            EQU  H'03FB'
ADCSEL1          EQU  H'03FC'
ADCSEL2          EQU  H'03FD'
ADCSEL3          EQU  H'03FE'
ADCSEL4          EQU  H'03FF'
ANSELA           EQU  H'0400'
WPUA             EQU  H'0401'
ODCONA           EQU  H'0402'
SLRCONA          EQU  H'0403'
INLVLA           EQU  H'0404'
IOCAP            EQU  H'0405'
IOCAN            EQU  H'0406'
IOCAF            EQU  H'0407'
ANSELB           EQU  H'0408'
WPUB             EQU  H'0409'
ODCONB           EQU  H'040A'
SLRCONB          EQU  H'040B'
INLVLB           EQU  H'040C'
IOCBP            EQU  H'040D'
IOCBN            EQU  H'040E'
IOCBF            EQU  H'040F'
ANSELC           EQU  H'0410'
WPUC             EQU  H'0411'
ODCONC           EQU  H'0412'
SLRCONC          EQU  H'0413'
INLVLC           EQU  H'0414'
IOCCP            EQU  H'0415'
IOCCN            EQU  H'0416'
IOCCF            EQU  H'0417'
ANSELD           EQU  H'0418'
WPUD             EQU  H'0419'
ODCOND           EQU  H'041A'
SLRCOND          EQU  H'041B'
INLVLD           EQU  H'041C'
ANSELE           EQU  H'0420'
WPUE             EQU  H'0421'
ODCONE           EQU  H'0422'
SLRCONE          EQU  H'0423'
INLVLE           EQU  H'0424'
IOCEP            EQU  H'0425'
IOCEN            EQU  H'0426'
IOCEF            EQU  H'0427'
ANSELF           EQU  H'0428'
WPUF             EQU  H'0429'
ODCONF           EQU  H'042A'
SLRCONF          EQU  H'042B'
INLVLF           EQU  H'042C'
IOCWP            EQU  H'043D'
IOCWN            EQU  H'043E'
IOCWF            EQU  H'043F'
NCO1ACC          EQU  H'0440'
NCO1ACCL         EQU  H'0440'
NCO1ACCH         EQU  H'0441'
NCO1ACCU         EQU  H'0442'
NCO1INC          EQU  H'0443'
NCO1INCL         EQU  H'0443'
NCO1INCH         EQU  H'0444'
NCO1INCU         EQU  H'0445'
NCO1CON          EQU  H'0446'
NCO1CLK          EQU  H'0447'
FSCMCON          EQU  H'0458'
IVTLOCK          EQU  H'0459'
IVTAD            EQU  H'045A'
IVTADL           EQU  H'045A'
IVTADH           EQU  H'045B'
IVTADU           EQU  H'045C'
IVTBASE          EQU  H'045D'
IVTBASEL         EQU  H'045D'
IVTBASEH         EQU  H'045E'
IVTBASEU         EQU  H'045F'
PWM1ERS          EQU  H'0460'
PWM1CLK          EQU  H'0461'
PWM1LDS          EQU  H'0462'
PWM1PR           EQU  H'0463'
PWM1PRL          EQU  H'0463'
PWM1PRH          EQU  H'0464'
PWM1CPRE         EQU  H'0465'
PWM1PIPOS        EQU  H'0466'
PWM1GIR          EQU  H'0467'
PWM1GIE          EQU  H'0468'
PWM1CON          EQU  H'0469'
PWM1S1CFG        EQU  H'046A'
PWM1S1P1         EQU  H'046B'
PWM1S1P1L        EQU  H'046B'
PWM1S1P1H        EQU  H'046C'
PWM1S1P2         EQU  H'046D'
PWM1S1P2L        EQU  H'046D'
PWM1S1P2H        EQU  H'046E'
PWM2ERS          EQU  H'046F'
PWM2CLK          EQU  H'0470'
PWM2LDS          EQU  H'0471'
PWM2PR           EQU  H'0472'
PWM2PRL          EQU  H'0472'
PWM2PRH          EQU  H'0473'
PWM2CPRE         EQU  H'0474'
PWM2PIPOS        EQU  H'0475'
PWM2GIR          EQU  H'0476'
PWM2GIE          EQU  H'0477'
PWM2CON          EQU  H'0478'
PWM2S1CFG        EQU  H'0479'
PWM2S1P1         EQU  H'047A'
PWM2S1P1L        EQU  H'047A'
PWM2S1P1H        EQU  H'047B'
PWM2S1P2         EQU  H'047C'
PWM2S1P2L        EQU  H'047C'
PWM2S1P2H        EQU  H'047D'
PWM3ERS          EQU  H'047E'
PWM3CLK          EQU  H'047F'
PWM3LDS          EQU  H'0480'
PWM3PR           EQU  H'0481'
PWM3PRL          EQU  H'0481'
PWM3PRH          EQU  H'0482'
PWM3CPRE         EQU  H'0483'
PWM3PIPOS        EQU  H'0484'
PWM3GIR          EQU  H'0485'
PWM3GIE          EQU  H'0486'
PWM3CON          EQU  H'0487'
PWM3S1CFG        EQU  H'0488'
PWM3S1P1         EQU  H'0489'
PWM3S1P1L        EQU  H'0489'
PWM3S1P1H        EQU  H'048A'
PWM3S1P2         EQU  H'048B'
PWM3S1P2L        EQU  H'048B'
PWM3S1P2H        EQU  H'048C'
PWMLOAD          EQU  H'0499'
PWMEN            EQU  H'049A'
IPR0             EQU  H'049C'
IPR1             EQU  H'049D'
IPR2             EQU  H'049E'
IPR3             EQU  H'049F'
IPR4             EQU  H'04A0'
IPR5             EQU  H'04A1'
IPR6             EQU  H'04A2'
IPR7             EQU  H'04A3'
IPR8             EQU  H'04A4'
IPR9             EQU  H'04A5'
IPR10            EQU  H'04A6'
PIE0             EQU  H'04A7'
PIE1             EQU  H'04A8'
PIE2             EQU  H'04A9'
PIE3             EQU  H'04AA'
PIE4             EQU  H'04AB'
PIE5             EQU  H'04AC'
PIE6             EQU  H'04AD'
PIE7             EQU  H'04AE'
PIE8             EQU  H'04AF'
